controle/app/Models/ChamadoModel.php

SELECT `status`, COUNT(*) as total
FROM `chamados`
GROUP BY `status`
---
    public function contarPorStatus($empresaId = null, $usuarioId = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);

        $builder->select('status, COUNT(*) as total');

        if ($empresaId) {
            $builder->where('empresa_id', $empresaId);
        }

        if ($usuarioId) {
            $builder->where('usuario_id', $usuarioId);
        }

        $builder->groupBy('status');

        $resultado = $builder->get()->getResult();

SELECT `tipo`, COUNT(*) as total
FROM `chamados`
GROUP BY `tipo`
---
    public function contarPorTipo($empresaId = null, $usuarioId = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);

        $builder->select('tipo, COUNT(*) as total');

        if ($empresaId) {
            $builder->where('empresa_id', $empresaId);
        }

        if ($usuarioId) {
            $builder->where('usuario_id', $usuarioId);
        }

        $builder->groupBy('tipo');

        $resultado = $builder->get()->getResult();