controle/app/Controllers/BaseController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '7'
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        $this->session = \Config\Services::session();

        // Carregar dados do usuário logado
        if ($this->session->has('usuario_id')) {
            $usuarioModel = new \App\Models\UsuarioModel();
            $this->usuarioLogado = $usuarioModel->find($this->session->get('usuario_id'));